applications/rhoFixedFlowFoam/tests/paperMode/corners/system/controlDict
/*------------------------------------------------------------------------------

system/controlDict of tests/paperMode/corners

  Two steps of 1 ms, every step written in binary.

------------------------------------------------------------------------------*/
FoamFile {version 2.0; format ascii; class dictionary; object controlDict;}

application       rhoFixedFlowFoam;
startFrom         latestTime;
startTime         0;
stopAt            endTime;
endTime           0.002;
deltaT            0.001;
writeControl      timeStep;
writeInterval     1;
purgeWrite        0;
writeFormat       binary;
writeCompression  off;
timeFormat        general;
timePrecision     6;
runTimeModifiable false;

speciesTransport {
  tolerance          1e-12;
  nCorr              5;
  writeFrozenFields  no;
}
