applications/rhoFixedFlowFoam/tests/paperMode/corners/constant/thermochemistryProperties
/*------------------------------------------------------------------------------

constant/thermochemistryProperties of tests/paperMode/corners

  The temperature model below Tdep everywhere (700 K, Tdep 800 K), so that
  every layer cell deposits from the uniform gas Y = 0.1 in the first step.
  The test sets the distance: 7.5e-5 m selects the cells within 0.05 mm of
  WALLB only (the corner cell of WALLB and WALLC among them), 1.25e-4 m
  also those within 0.1 mm of WALLA and WALLC and the cell at the
  re-entrant corner (0.1118 mm).

------------------------------------------------------------------------------*/
FoamFile {version 2.0; format ascii; class dictionary; object thermochemistryProperties;}

model temperature;

pairs { PbI2_g { condensed PbI2_s; } }

interface {
  patches  (WALLA WALLB WALLC);
  layer    distance;
  distance 7.5e-5;
}

temperatureCoeffs { A 220; k 8e-3; Tdep 800; }

balance { nGuard 3; guardTolerance 1e-12; }
