applications/rhoFixedFlowFoam/tests/paperMode/corners/0/p
FoamFile {version 2.0; format ascii; class volScalarField; object p;}
dimensions    [1 -1 -2 0 0 0 0];
internalField uniform 101325;
boundaryField {
  "(INLET|OUTLET|SIDE|WALLA|WALLB|WALLC)" {type calculated; value uniform 101325;}
  FRONTBACK {type empty;}
}
