applications/rhoFixedFlowFoam/tests/paperMode/corners/0/T
FoamFile {version 2.0; format ascii; class volScalarField; object T;}
dimensions    [0 0 0 1 0 0 0];
internalField uniform 700;
boundaryField {
  "(INLET|OUTLET|SIDE|WALLA|WALLB|WALLC)" {type calculated; value uniform 700;}
  FRONTBACK {type empty;}
}
