applications/rhoFixedFlowFoam/tests/paperMode/corners/0/Y_PbI2_s
FoamFile {version 2.0; format ascii; class volScalarField; object Y_PbI2_s;}
dimensions    [0 0 0 0 0 0 0];
internalField uniform 0;
boundaryField {
  "(INLET|OUTLET|SIDE|WALLA|WALLB|WALLC)" {type zeroGradient;}
  FRONTBACK {type empty;}
}
